codebusters/codebusters.md

# Table of Contents

1.  [Todo Dump](#orgbbc9793)
    1.  [get useful links and the like set up](#org7a047d1)
    2.  [provide summaries for most of the ciphers we&rsquo;ll be encountering](#org4708175)
2.  [Basic Info](#org548e188)
    1.  [Codebusters Website](#orgd70d500)
    2.  [PDF of the overview is in this repo](#orgd881fa0)
3.  [Practice Tests](#org56d985c)



<a id="orgbbc9793"></a>

# Todo Dump


<a id="org7a047d1"></a>

## DONE get useful links and the like set up

<span class="timestamp-wrapper"><span class="timestamp">&lt;2025-01-22 Wed&gt;</span></span>


<a id="org4708175"></a>

## TODO provide summaries for most of the ciphers we&rsquo;ll be encountering

A link is available in the overview pdf attatched to the repo


<a id="org548e188"></a>

# Basic Info


<a id="orgd70d500"></a>

## [Codebusters Website](https://www.soinc.org/codebusters-c)


<a id="orgd881fa0"></a>

## PDF of the overview is in this repo


<a id="org56d985c"></a>

# Practice Tests

I found a good practice test online that has an explanation of the solutions for harder problems, it&rsquo;s in the practice<sub>tests</sub> directory labelled **practice<sub>with</sub><sub>explanations.pdf</sub>**. You can also find it [here](https://drive.google.com/drive/folders/1D3jN489fuNuuHg_8pqMtCI-S0A2Wjjom) under the file **Codebusters.pdf**

[Here is another practice test that has answer key and solutions separated](https://drive.google.com/drive/folders/14dhuxd4uKyZERV9U865uUbVkPmu0xdf5), we should go through this together and provide explanations for each solution

